;;;;;;;;;;;;;;;;;;;;;;;;;; NEW UNITS ;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[ShadowbindUnitM4 X2CharacterTemplate]
strCharacterName="Shadow Prime"

;;;;;;;;;;;;;;;;;;;;;;;;;; NEW ABILITIES ;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[ShadowbindM4 X2AbilityTemplate]
LocFriendlyName="Shadowbind"
LocHelpText="Creates a shadowy copy of a humanoid target, which retains all of the target's abilities."
LocLongDescription="Creates a shadowy copy of a humanoid target, which retains all of the target's abilities."
LocFlyOverText="Shadowbind"

[ShadowReaction X2AbilityTemplate]
LocFriendlyName="Ghost Ride"
LocLongDescription="Whenever hurt, the Shadow Prime gets an immediate reaction"
LocHelpText="Ghost Ride."
LocFlyOverText="Ghost Ride"

[WarCry_ASA X2AbilityTemplate]
LocFriendlyName="War Cry"
LocLongDescription="Grant major Aim, Will and Mobility bonuses to other Mutons and lesser bonuses to other sapient aliens and ADVENT. 6-turn cooldown."
LocHelpText="Grant bonuses to other Mutons and some other aliens."
LocFlyOverText="War Cry"
LocPromotionPopupText="<Bullet/> Grant major Aim, Will and Mobility bonuses to other Mutons and lesser bonuses to many other sapient aliens and ADVENT.<br/><Bullet/> 6-turn cooldown.<br/>"

[Beastmaster_ASA X2AbilityTemplate]
LocFriendlyName="Beastmaster"
LocLongDescription="Immune to damage from Berserkers."
LocHelpText="Immune to damage from Berserkers."
LocFlyOverText="Beastmaster"
LocPromotionPopupText="<Bullet/> Immune to damage from Berserkers.<br/>"

[StaffControl X2AbilityTemplate]
LocFriendlyName="Staff Control"
LocLongDescription="All Staff attacks have +<Ability:STAFFCONTROLAIM/> Aim."
LocHelpText="Extra <Ability:STAFFCONTROLAIM/> aim on all Staff attacks."
LocFlyOverText="Staff Control"
LocPromotionPopupText="<Bullet/> Staff Control grants +<Ability:STAFFCONTROLAIM/> Aim to melee attacks.<br/>"

[SectopodLightningStorm X2AbilityTemplate]
LocFriendlyName="Lightning Storm"
LocLongDescription="The Sectopod Prime's Lightning field activates whenever an enemy approaches it in melee range"
LocHelpText="Unleash a blast of electricity around the Sectopod Prime"

[HorrorM4 X2AbilityTemplate]
LocFriendlyName="Horror"
LocHelpText="Tentacles from the Spectre reach out and bind a humanoid target, damaging the target and healing the Spectre."
LocLongDescription="Tentacles from the Spectre reach out and bind a humanoid target, damaging the target and healing the Spectre."
LocFlyOverText="Horror!"

;;;;;;;;;;;;;;;;;;;;;;;;;; NEW WEAPONS ;;;;;;;;;;;;;;;;;;;;;;;;;;;;

[ArchonStaff_LifeLeech X2WeaponTemplate]
FriendlyName="Archon Staff"
FriendlyNamePlural="Archon Staves"
BriefSummary="XCOM has managed to salvage a variety of standard infantry small arms; this is the most common variety, similar to the rifle used twenty years before. While decidedly inferior to ADVENT magnetic technology, it can at least be upgraded using additional weapons salvage, once a standard technical approach is discovered."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> If the soldier fires with both actions available, three shots will be taken at reduced accuracy, but overall increased efficiency\n<Bullet/> Use upgrades looted from enemies to improve assault rifle tactical effectiveness"

[PurifierGrenade X2GrenadeTemplate]
FriendlyName="Incendiary Grenade"
FriendlyNamePlural="Incendiary Grenades"
BriefSummary="The Incendiary Grenade is a technical improvement to the improvised fire weapons the Resistance has been using for years. After the initial blast, most targets will be set aflame and suffer persistent burning damage."
TacticalText="<Bullet/> Incendiary grenades will damage all units in the blast radius, and apply the \"burning\" effect to any units vulnerable to flame.\n<Bullet/> Incendiary grenades do more blast damage than all other grenades.\n<Bullet/> Some enemies, particularly metallic ones, are immune to fire and will not suffer the \"burning\" effect."
ThrownAbilityName="Throw Incendiary Grenade"
ThrownAbilityHelpText="Sets fire to the target area, along with affected units."
LaunchedAbilityname="Launch Incendiary Grenade"
LaunchedAbilityHelpText="Sets fire to the target area, along with affected units."

[PurifierPistolM1_WPN X2WeaponTemplate]
FriendlyName="ADVENT Mag Pistol"
FriendlyNamePlural="ADVENT Mag Pistols"
BriefSummary="A Magnetic rail pistol of ADVENT design. Generation 1."
TacticalText="<Bullet/> ADVENT Mag Pistol G1."
AbilityDescName="pistol"

[PurifierPistolM2_WPN X2WeaponTemplate]
FriendlyName="ADVENT Mag Pistol #2"
FriendlyNamePlural="ADVENT Mag Pistols"
BriefSummary="A Magnetic rail pistol of ADVENT design. Generation 2."
TacticalText="<Bullet/> ADVENT Mag Pistol G2."
AbilityDescName="pistol"

[PurifierPistolM3_WPN X2WeaponTemplate]
FriendlyName="ADVENT Mag Pistol #3"
FriendlyNamePlural="ADVENT Mag Pistols"
BriefSummary="A Magnetic rail pistol of ADVENT design. Generation 3."
TacticalText="<Bullet/> ADVENT Mag Pistol G3."
AbilityDescName="pistol"
